Repository: airtaxi/DeskBorder
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# SettingsPage_NavigatorSectionTeachingTipContentTextBlock.Text
source: • Enable trigger area: when the pointer enters the configured screen region, the display-only Navigator mini map appears at the bottom of the monitor that currently contains the pointer. • Select area: opens a selection overlay on the monitor that currently shows the settings window. The dragged rectangle is saved as-is, and the DeskBorder service pauses while you are selecting. • If you also enable the Navigator mini map hotkey in the global hotkeys section, both the shortcut and mouse area triggers stay active together.
ja_jp: • トリガー領域を有効化: ポインターが指定した画面領域に入ると、ポインターがあるモニターの下部に表示専用の Navigator ミニマップを表示します。 • 領域を選択: ボタンを押すと、現在設定ウィンドウが表示されているモニターに選択オーバーレイが開きます。ドラッグした矩形がそのままトリガー領域として保存され、選択中は DeskBorder サービスが一時停止します。 • グローバル ホットキー セクションの Navigator ミニマップ切り替えも有効にすると、ショートカットとマウス領域の両方で動作します。
zh_hans: • 启用触发区域：当指针进入指定屏幕区域时，会在当前指针所在显示器的底部显示仅用于展示的 Navigator 缩略图。 • 选择区域：点击按钮后，会在当前显示设置窗口的显示器上打开选择叠加层。拖拽出的矩形会原样保存为触发区域，选择期间 DeskBorder 服务会暂时暂停。 • 如果同时启用全局热键中的 Navigator 缩略图切换，则快捷键和鼠标区域触发会一起生效。
zh_hant: • 啟用觸發區域：當指標進入指定的螢幕區域時，會在目前指標所在螢幕的底部顯示僅供展示的 Navigator 縮圖。 • 選取區域：按下按鈕後，會在目前顯示設定視窗的螢幕上開啟選取覆疊層。拖曳出的矩形會原樣儲存為觸發區域，選取期間 DeskBorder 服務會暫時暫停。 • 若同時啟用全域熱鍵區段中的 Navigator 縮圖切換，快捷鍵與滑鼠區域兩種觸發方式會同時生效。

# SettingsPage_NavigatorToggleHotkeyKeyComboBox.Header
source: Primary key
ja_jp: メイン キー
zh_hans: 主按键
zh_hant: 主要按鍵

# SettingsPage_NavigatorToggleHotkeyModifierTextBlock.Text
source: Modifiers
ja_jp: 修飾キー
zh_hans: 修饰键
zh_hant: 修飾鍵

# SettingsPage_NavigatorToggleHotkeyToggleSwitch.Header
source: Toggle Navigator mini map
ja_jp: Navigator ミニマップを切り替え
zh_hans: 切换 Navigator 缩略图
zh_hant: 切換 Navigator 縮圖

# SettingsPage_NavigatorTriggerAreaToggleSwitch.Header
source: Enable trigger area
ja_jp: トリガー領域を有効化
zh_hans: 启用触发区域
zh_hant: 啟用觸發區域

# SettingsPage_NavigatorTriggerAreaHintTextBlock.Text
source: Click Select area to drag a region on the monitor that currently shows the settings window. The DeskBorder service pauses while the selector is open.
ja_jp: 「領域を選択」を押すと、現在設定ウィンドウがあるモニター上でドラッグして指定できます。選択 UI が開いている間、DeskBorder サービスは一時停止します。
zh_hans: 点击“选择区域”后，可在当前显示设置窗口的显示器上通过拖拽指定区域。选择器打开期间 DeskBorder 服务会暂时暂停。
zh_hant: 按一下「選取區域」後，即可在目前顯示設定視窗的螢幕上拖曳指定區域。選取器開啟期間 DeskBorder 服務會暫時暫停。

# SettingsPage_NavigatorTriggerAreaSummaryTitleTextBlock.Text
source: Selected area
ja_jp: 選択した領域
zh_hans: 已选区域
zh_hant: 已選區域

# SettingsPage_SelectNavigatorTriggerAreaButton.Content
source: Select area
ja_jp: 領域を選択
zh_hans: 选择区域
zh_hant: 選取區域

# SettingsPage_NavigatorTriggerHeightNumberBox.Header
source: Height (%)
ja_jp: 高さ (%)
zh_hans: 高度 (%)
zh_hant: 高度 (%)

# SettingsPage_NavigatorTriggerLeftNumberBox.Header
source: Horizontal position (%)
ja_jp: 横位置 (%)
zh_hans: 横向位置 (%)
zh_hant: 橫向位置 (%)

# SettingsPage_NavigatorTriggerTopNumberBox.Header
source: Vertical position (%)
ja_jp: 縦位置 (%)
zh_hans: 纵向位置 (%)
zh_hant: 縱向位置 (%)

# SettingsPage_NavigatorTriggerWidthNumberBox.Header
source: Width (%)
ja_jp: 幅 (%)
zh_hans: 宽度 (%)
zh_hant: 寬度 (%)

# SettingsPage_PendingBlacklistedProcessNameTextBox.Header
source: Process name
ja_jp: プロセス名
zh_hans: 进程名称
zh_hant: 處理程序名稱

# SettingsPage_PendingBlacklistedProcessNameTextBox.PlaceholderText
source: Example: explorer.exe
ja_jp: 例: explorer.exe
zh_hans: 例如：explorer.exe
zh_hant: 例如：explorer.exe

# SettingsPage_RemoveBlacklistedProcessNameButtonToolTip.Content
source: Remove
ja_jp: 削除
zh_hans: 移除
zh_hant: 移除

# SettingsPage_StoreUpdateCheckToggleSwitch.Header
source: Check for Store updates
ja_jp: Store 更新を自動確認
zh_hans: 检查 Store 更新
zh_hant: 自動檢查 Store 更新

# SettingsPage_BlacklistSectionTeachingTip.Title
source: Blacklist guide
ja_jp: ブラックリスト ガイド
zh_hans: 黑名单说明
zh_hant: 黑名單說明

# SettingsPage_BlacklistSectionTeachingTipContentTextBlock.Text
source: • Add from running processes: lets you pick only currently running processes that are not already registered. • Listed processes are excluded from edge switching, desktop creation, and auto deletion handling. • Keep games or full-screen apps here when DeskBorder should not interfere with them.
ja_jp: • 実行中のプロセスから追加: 現在実行中で、まだ登録されていないプロセスだけを選んで追加できます。 • 登録済みプロセスは、エッジ切り替え、デスクトップ作成、自動削除の処理対象から除外されます。 • DeskBorder が干渉してほしくないゲームや全画面アプリをここに登録してください。
zh_hans: • 从运行中的进程添加：只显示当前正在运行且尚未注册的进程供选择。 • 已列出的进程会从边缘切换、桌面创建和自动删除处理中排除。 • 可将不希望 DeskBorder 干预的游戏或全屏应用保存在这里。
zh_hant: • 從執行中的處理程序新增：只會顯示目前正在執行且尚未註冊的處理程序供你挑選。 • 已列出的處理程序會從邊緣切換、桌面建立與自動刪除處理中排除。 • 可將不希望 DeskBorder 干預的遊戲或全螢幕應用程式放在這裡。

# SettingsPage_EdgeSectionTeachingTip.Title
source: Edges and auto cleanup guide
ja_jp: エッジと自動整理ガイド
zh_hans: 边缘与自动整理说明
zh_hant: 邊緣與自動整理說明

# SettingsPage_EdgeSectionTeachingTipContentTextBlock.Text
source: • Auto delete empty desktops: deletes an outer desktop when you move inward and it no longer has windows. • Show deletion warning: when enabled, deletion waits briefly so you can undo it; when disabled, empty desktops are deleted immediately for continuous cleanup. • Deletion warning timeout: adjusts how long the undo wait lasts while the deletion warning is shown. • Empty desktop detection: a desktop counts as empty only when the wallpaper is actually visible. Minimized windows do not block auto deletion. • Top and bottom ignore zones: adjusts, in percentages, how much of the upper and lower screen area should ignore edge switching and desktop creation. • Enable desktop creation: turns the creation of a new desktop from the right edge of the last desktop on or off. • Switch desktop modifiers: key combination that must be held before edge-based desktop switching triggers. • Create desktop modifiers: key combination required to create a new desktop from the right edge of the last desktop.
ja_jp: • 空のデスクトップを自動削除: 外側デスクトップから内側へ移動するとき、ウィンドウが無ければ削除します。 • 削除前の警告を表示: オンにすると取り消し可能な短い待機のあとで削除し、オフにすると警告なしで即座に削除して連続整理できます。 • 削除前の警告タイムアウト: 削除前の警告を表示している間、取り消しを待つ時間を調整します。 • 空のデスクトップ判定: 壁紙が実際に見えている状態のときだけ空のデスクトップとして扱います。最小化されたウィンドウは削除を妨げません。 • 上側/下側の無視領域: 画面の上下の一部ではエッジ切り替えとデスクトップ作成が反応しないよう、割合で調整します。 • デスクトップ作成を有効化: 最後のデスクトップの右端から新しいデスクトップを作る機能自体をオンまたはオフにします。 • デスクトップ切り替えの修飾キー: 画面端でデスクトップ切り替えを発動する前に押しておくキーの組み合わせです。 • デスクトップ作成の修飾キー: 最後のデスクトップの右端から新しいデスクトップを作るときに必要なキーの組み合わせです。
zh_hans: • 自动删除空桌面：当你从最外侧桌面向内移动且该桌面已无窗口时，会删除该桌面。 • 显示删除警告：开启后会先短暂等待并允许撤销，关闭后则不显示警告并立即删除，以便连续整理。 • 删除警告超时：调整显示删除警告时等待撤销的时间。 • 空桌面判定：只有在壁纸实际可见时才视为空桌面。已最小化的窗口不会阻止自动删除。 • 顶部/底部忽略区域：用百分比调整屏幕上下有多少区域不响应边缘切换和桌面创建。 • 启用桌面创建：开启或关闭在最后一个桌面的右边缘创建新桌面的功能。 • 切换桌面修饰键：在屏幕左右边缘触发桌面切换前必须按住的组合键。 • 创建桌面修饰键：在最后一个桌面的右边缘创建新桌面时所需的组合键。
zh_hant: • 自動刪除空桌面：當你從最外側桌面往內移動且該桌面已無視窗時，會刪除該桌面。 • 顯示刪除警告：開啟後會先短暫等待並允許復原，關閉後則不顯示警告並立即刪除，以便連續整理。 • 刪除警告逾時：調整顯示刪除警告時等待復原的時間。 • 空桌面判定：只有在桌布實際可見時才視為空桌面。已最小化的視窗不會阻止自動刪除。 • 頂部/底部忽略區域：以百分比調整螢幕上下有多少區域不回應邊緣切換與桌面建立。 • 啟用桌面建立：開啟或關閉在最後一個桌面的右邊緣建立新桌面的功能。 • 桌面切換修飾鍵：在螢幕左右邊緣觸發桌面切換前必須按住的組合鍵。 • 桌面建立修飾鍵：在最後一個桌面的右邊緣建立新桌面時所需的組合鍵。

# SettingsPage_TopDesktopEdgeIgnorePercentageNumberBox.Header
source: Top ignore zone (%)
ja_jp: 上側の無視領域 (%)
zh_hans: 顶部忽略区域 (%)
zh_hant: 頂部忽略區域 (%)

# SettingsPage_SwitchDesktopModifierTitleTextBlock.Text
source: Desktop switch modifiers
ja_jp: デスクトップ切り替え修飾キー
zh_hans: 切换桌面修饰键
zh_hant: 切換桌面修飾鍵

# SettingsPage_TitleTextBlock.Text
source: Settings
ja_jp: 設定
zh_hans: 设置
zh_hant: 設定

# SettingsPage_ToggleDeskBorderHotkeyKeyComboBox.Header
source: Primary key
ja_jp: メイン キー
zh_hans: 主按键
zh_hant: 主要按鍵

# SettingsPage_ToggleDeskBorderHotkeyModifierTextBlock.Text
source: Modifiers
ja_jp: 修飾キー
zh_hans: 修饰键
zh_hant: 修飾鍵

# SettingsPage_ToggleDeskBorderHotkeyToggleSwitch.Header
source: Toggle DeskBorder hotkey
ja_jp: DeskBorder 切り替えホットキー
zh_hans: 切换 DeskBorder 热键
zh_hant: 切換 DeskBorder 熱鍵

# Toast.AutoDelete.Action
source: Undo
ja_jp: 元に戻す
zh_hans: 撤销
zh_hant: 復原

# Toast.AutoDelete.ActionCardTitle
source: Keep this desktop
ja_jp: このデスクトップを維持
zh_hans: 保留此桌面
zh_hant: 保留此桌面

# Toast.AutoDelete.MessageFormat
source: {0} will be deleted unless you undo this action.
ja_jp: {0} は、この操作を元に戻さない限り削除されます。
zh_hans: 除非撤销此操作，否则将删除 {0}。
zh_hant: 除非復原此操作，否則將刪除 {0}。

# Toast.AutoDelete.Title
source: Outer desktop scheduled for deletion
ja_jp: 外側のデスクトップは削除予定です
zh_hans: 外侧桌面已计划删除
zh_hant: 外側桌面已排定刪除

# Toast.WindowTitle
source: Toast
ja_jp: トースト
zh_hans: 通知
zh_hant: 通知

# Tray.LaunchOnStartup
source: Run at system startup
ja_jp: システム起動時に実行
zh_hans: 随系统启动运行
zh_hant: 系統啟動時執行

# Tray.RuntimeStatus.Paused
source: ○ DeskBorder service paused
ja_jp: DeskBorder サービス一時停止中
zh_hans: ○ DeskBorder 服务已暂停
zh_hant: DeskBorder 服務已暫停

# Tray.RuntimeStatus.Running
source: ● DeskBorder service running
ja_jp: DeskBorder サービス実行中
zh_hans: ● DeskBorder 服务正在运行
zh_hant: DeskBorder 服務執行中

# Tray.RuntimeToggle
source: Enable DeskBorder
ja_jp: DeskBorder を有効化
zh_hans: 启用 DeskBorder
zh_hant: 啟用 DeskBorder

# Tray.StoreUpdateCheck
source: Check for Store updates
ja_jp: Store 更新を自動確認
zh_hans: 检查 Store 更新
zh_hant: 自動檢查 Store 更新

# TriggerRectangle.Format
source: Left {0:P0}, Top {1:P0}, Width {2:P0}, Height {3:P0}
ja_jp: 左 {0:P0}、上 {1:P0}、幅 {2:P0}、高さ {3:P0}
zh_hans: 左侧 {0:P0}，顶部 {1:P0}，宽度 {2:P0}，高度 {3:P0}
zh_hant: 左側 {0:P0}，頂部 {1:P0}，寬度 {2:P0}，高度 {3:P0}

# NavigatorTriggerAreaSelectionWindow.WindowTitle
source: Select Navigator trigger area
ja_jp: Navigator トリガー領域を選択
zh_hans: 选择 Navigator 触发区域
zh_hant: 選取 Navigator 觸發區域

# NavigatorTriggerAreaSelectionWindow.Title
source: Select the Navigator trigger area
ja_jp: Navigator トリガー領域を選択
zh_hans: 选择 Navigator 触发区域
zh_hant: 選取 Navigator 觸發區域

# NavigatorTriggerAreaSelectionWindow.Description
source: Drag to choose an area. Press Escape to cancel. The DeskBorder service stays paused while this selector is open.
ja_jp: ドラッグして領域を選択してください。Esc キーで取り消せます。この選択 UI が開いている間、DeskBorder サービスは一時停止します。
zh_hans: 拖拽以选择区域。按 Esc 可取消。选择器打开期间 DeskBorder 服务会暂时暂停。
zh_hant: 拖曳以選取區域。按 Esc 可取消。選取器開啟期間 DeskBorder 服務會暫時暫停。

# VirtualKey.Delete
source: Delete
zh_hans: 删除

# VirtualKey.Down
source: Down Arrow
ja_jp: 下方向キー
zh_hans: 下方向键
zh_hant: 下方向鍵

# VirtualKey.Escape
source: Escape
ja_jp: Esc
zh_hans: Esc
zh_hant: Esc

# VirtualKey.Left
source: Left Arrow
ja_jp: 左方向キー
zh_hans: 左方向键
zh_hant: 左方向鍵

# VirtualKey.Right
source: Right Arrow
ja_jp: 右方向キー
zh_hans: 右方向键
zh_hant: 右方向鍵

# VirtualKey.Space
source: Space
zh_hans: 空格
zh_hant: 空白鍵

# VirtualKey.Up
source: Up Arrow
ja_jp: 上方向キー
zh_hans: 上方向键
zh_hant: 上方向鍵
